ITS/VOS/videooverlay.settextposition.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:voverlay">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:settextposition>
   <lanepos>0</lanepos>
   <staffpos>0</staffpos>
   <classpos>0</classpos>
   <licensenumberpos>0</licensenumberpos>
   <pricepos>0</pricepos>
   <timestamppos>0</timestamppos>
  </ns:settextposition>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
